# GetCurves Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModel..::..GetCurves Method
AnalyticalModel Class See Also
---
Retrieves all curves for the Analytical Model of a given type.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public IList<Curve> GetCurves(
	AnalyticalCurveType curveType
)
```

Visual Basic
---
```text
Public Function GetCurves ( _
	curveType As AnalyticalCurveType _
) As IList(Of Curve)
```

Visual C++
---
```text
public:
IList<Curve^>^ GetCurves(
	AnalyticalCurveType curveType
)
```

# ### Parameters
curveType
    Type: Autodesk.Revit.DB.Structure..::..AnalyticalCurveType Which curve type should be returned.
# ### Return Value
An array of curves representing analytical model.
# Remarks
If the analytical model contains no curves of the given type, then the returned array may be empty.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace